{
    "projects": [
      {
        "title": "Clothes Online Store",
        "year": 2022,
        "type": "University Project",
        "cover": {
          "path": "../../assets/projects/clothes-store/cover.jpg",
          "alt": "Screenshot of clothes online store homepage featuring product grid and navigation menu"
        },
        "images": [
          {
            "path": "../../assets/projects/clothes-store/cover-02.png",
            "alt": "Homepage of clothes online store showing featured products and search functionality"
          },
          {
            "path": "../../assets/projects/clothes-store/image-01.jpg",
            "alt": "Full homepage layout displaying product categories, promotional banners, and footer"
          },
          {
            "path": "../../assets/projects/clothes-store/image-02.jpg",
            "alt": "User profile settings page with account information and preferences options"
          }
        ],
        "tools": ["HTML5", "CSS", "JavaScript", "GitHub"],
        "github-link": "https://github.com/pistashioz/Trabalho-pratico---TW",
        "description": "This was my very first university project, developed in a team during the Web Technologies course. Our goal was to design and build a fully functional website using HTML, CSS, and JavaScript — applying the fundamentals of web development in a real-world context. I was mainly responsible for the JavaScript implementation, as well as the logo and overall visual design of the site. Although I can now identify many areas I'd approach differently, I choose to include this project because it marks the starting point of my journey. It reflects my early understanding of core web technologies, and most importantly, shows how far I've come since then. After all, everyone starts somewhere."
      },
      {
        "title": "Portfolio Design",
        "cover": {
          "path": "../../assets/projects/portfolio-design/cover.jpg",
          "alt": "Figma design mockup of photographer and cinema director portfolio website"
        },
        "images": [
          {
            "path": "../../assets/projects/portfolio-design/cover-02.png",
            "alt": "Homepage design featuring hero section with photographer's signature work"
          },
          {
            "path": "../../assets/projects/portfolio-design/image-01.png",
            "alt": "Complete homepage layout showing navigation, hero image, and introduction section"
          },
          {
            "path": "../../assets/projects/portfolio-design/image-02.png",
            "alt": "Projects page displaying City of God movie poster and cinematography samples"
          },
          {
            "path": "../../assets/projects/portfolio-design/image-03.png",
            "alt": "About me page with photographer biography and professional background"
          }
        ],
        "tools": ["Figma"],
        "github-link": null,
        "description": "This individual project involved designing a personal webpage that showcased a portfolio. The theme was open-ended, allowing us to assume any profession we wanted. I chose a design that reflects a professional persona in filmmaking. The project was fully developed using Figma, leveraging its design and prototyping features to create interactive elements."
      },
      {
        "title": "Workspace on Lockdown - Escape Room",
        "year": 2023,
        "type": "University Project",
        "cover": {
          "path": "../../assets/projects/workspace-on-lockdown/cover.jpg",
          "alt": "Interactive challenge screen from educational JavaScript escape room game"
        },
        "images": [
          {
            "path": "../../assets/projects/workspace-on-lockdown/cover-02.png",
            "alt": "Programming challenge interface with code editor and instructions panel"
          },
          {
            "path": "../../assets/projects/workspace-on-lockdown/image-01.jpg",
            "alt": "Memory sequence game challenge with colored buttons and score display"
          },
          {
            "path": "../../assets/projects/workspace-on-lockdown/image-02.jpg",
            "alt": "Game progress screen showing completed challenges and remaining tasks"
          },
          {
            "path": "../../assets/projects/workspace-on-lockdown/image-03.jpg",
            "alt": "New item discovery modal with achievement notification and description"
          },
          {
            "path": "../../assets/projects/workspace-on-lockdown/image-04.jpg",
            "alt": "Victory screen displaying completion message and final score"
          },
          {
            "path": "../../assets/projects/workspace-on-lockdown/image-05.jpg",
            "alt": "Game inventory interface showing collected items and tools"
          }
        ],
        "tools": ["HTML5", "CSS", "JavaScript", "Adobe AfterEffects", "GitHub", "Figma"],
        "github-link": "https://github.com/luisaapinho/ProjetoI",
        "description": "This interdisciplinary project was developed during the second semester of my first year. Our objective was to create a gamified e-learning platform to help students learn JavaScript programming in a fun and engaging way. I was responsible for the entire visual design of the game, including the illustrations, UI composition, color palette, and typography, all crafted in Figma. I also contributed to the front-end development of the platform and implemented one of the game's interactive challenges — a memory game based on color sequences, designed to reinforce programming concepts through playful repetition. The platform featured elements such as leaderboards, a mascot, and interactive challenges to make the experience more dynamic. This project gave me valuable experience in combining education, visual storytelling, and interactivity, while collaborating in a multidisciplinary team."
      },
      {
        "title": "Brazil Flights",
        "year": 2023,
        "type": "University Project",
        "cover": {
          "path": "../../assets/projects/brazil-flights/cover.jpg",
          "alt": "Landing page design for Brazil flights tracking dashboard application"
        },
        "images": [
          {
            "path": "../../assets/projects/brazil-flights/cover-02.png",
            "alt": "Homepage hero section with flight search functionality and Brazil map background"
          },
          {
            "path": "../../assets/projects/brazil-flights/image-01.png",
            "alt": "Complete landing page showing features, testimonials, and call-to-action sections"
          },
          {
            "path": "../../assets/projects/brazil-flights/image-02.png",
            "alt": "Dashboard interface displaying real-time flight data and interactive charts"
          },
          {
            "path": "../../assets/projects/brazil-flights/image-03.png",
            "alt": "Interactive map of Brazil with flight route pins and destination markers"
          },
          {
            "path": "../../assets/projects/brazil-flights/image-04.png",
            "alt": "User account settings page with profile customization options"
          }
        ],
        "tools": ["Vue", "Vuetify", "Chart.js", "Mock API", "Canvas", "Figma", "GitHub"],
        "github-link": "https://github.com/luisaapinho/Projeto-ECDI-PW",
        "description": "Developed in collaboration with a multidisciplinary team, this project involved building a dashboard to track live flights across Brazil. I was responsible for the entire visual design — including the landing page, color palette, typography, illustrations, and the design system in Figma. I also implemented the interactive map with pins and curated pop-up curiosities to enhance user engagement. Built with Vue.js, Vuetify, and Canvas, the platform combined real-time data with a user-friendly and visually rich interface."
      },
      {
        "title": "Good Mates",
        "year": 2024,
        "type": "University Project",
        "cover": {
          "path": "../../assets/projects/good-mates/cover.jpg",
          "alt": "Mobile app login screen with custom illustration and authentication options"
        },
        "images": [
          {
            "path": "../../assets/projects/good-mates/cover-02.png",
            "alt": "Welcome screen featuring custom illustration and login/register buttons"
          },
          {
            "path": "../../assets/projects/good-mates/image-01.png",
            "alt": "Login interface with hand-drawn illustration and authentication choices"
          },
          {
            "path": "../../assets/projects/good-mates/image-02.png",
            "alt": "Home dashboard showing shared household products and usage statistics"
          },
          {
            "path": "../../assets/projects/good-mates/image-03.png",
            "alt": "User profile page displaying personal shared products and contribution history"
          },
          {
            "path": "../../assets/projects/good-mates/image-04.png",
            "alt": "Product detail view with consumption tracking and sharing options"
          },
          {
            "path": "../../assets/projects/good-mates/image-05.jpg",
            "alt": "Usage analytics screen showing product consumption patterns and debt calculations"
          }
        ],
        "tools": ["Kotlin", "Firebase", "Notion", "Figma", "GitHub"],
        "github-link": "https://github.com/luisaapinho/Projeto-ECDI-PW",
        "description": "In this team project, we developed a mobile app to manage shared household resources through a virtual pantry. I was responsible for the entire design process, from wireflows and wireframes to UI/UX design, illustrations, and the front-end implementation — including the profile configuration system. The app allows users to add, track, and consume shared products, with automated debt calculation and notifications for restocking. The interface was designed in Figma, and the app was developed using Kotlin, with a strong focus on usability and collaboration."
      },
      {
        "title": "Lume",
        "year": 2025,
        "type": "University Project",
        "cover": {
          "path": "../../assets/projects/lume/cover.jpg",
          "alt": "Lume app onboarding screen with cooking-themed illustration and welcome message"
        },
        "images": [
          {
            "path": "../../assets/projects/lume/cover-02.png",
            "alt": "App introduction screen with personalized cooking journey setup"
          },
          {
            "path": "../../assets/projects/lume/image-01.jpg",
            "alt": "Login page with cooking-themed illustrations and social authentication options"
          },
          {
            "path": "../../assets/projects/lume/image-03.jpg",
            "alt": "Dashboard showing ongoing recipes, scheduled events, notes, and AI chat interface"
          },
          {
            "path": "../../assets/projects/lume/image-04.jpg",
            "alt": "Interactive cooking mode with step-by-step instructions and timer interface"
          },
          {
            "path": "../../assets/projects/lume/image-05.jpg",
            "alt": "Recipe discovery homepage with personalized filters and recommendation system"
          },
          {
            "path": "../../assets/projects/lume/image-07.jpg",
            "alt": "Onboarding personalization flow for dietary preferences and cooking skills"
          },
          {
            "path": "../../assets/projects/lume/image-08.jpg",
            "alt": "AI cooking assistant introduction screen with interactive chat preview"
          },
          {
            "path": "../../assets/projects/lume/image-09.jpg",
            "alt": "Gamification system showing achievement badges and cooking milestones"
          },
          {
            "path": "../../assets/projects/lume/image-10.jpg",
            "alt": "Chat interface with AI cooking assistant providing personalized recipe suggestions"
          }
        ],
        "tools": ["React Native", "Firebase", "MongoDB", "Figma", "Protopie", "Adobe AfterEffects", "Node.js", "GitLab", "Whimsical", "Notion"],
        "github-link": "https://gitlab.com/esmad/esmapp/esmad-2425/group-8/culinaryquest",
        "description": "This was one of the most challenging and complete projects I've worked on. We created a mobile app to help young people build healthier eating habits through meal planning, guided cooking, and gamified motivation. I led the entire visual design, including the high-fidelity prototype, custom illustrations, animations, and front-end in React Native. We used tools like Figma, Protopie, After Effects, Firebase, MongoDB, and Node.js to build a rich, user-focused experience. You can see more about this project in my <a href='https://www.behance.net/gallery/217492373/Lume-Igniting-Social-Cooking-Experiences'>Behance</a>."
      },
      {
        "title": "Internship at E-goi",
        "year": 2025,
        "type": "Intership Project",
        "cover": {
          "path": "../../assets/projects/internship/cover.jpg",
          "alt": "E-goi company logo representing digital marketing internship experience"
        },
        "images": [
          {
            "path": "../../assets/projects/internship/cover-02.png",
            "alt": "E-goi brand logo and visual identity elements"
          },
          {
            "path": "../../assets/projects/internship/image-01.png",
            "alt": "Custom e-book cover illustration featuring robot character with shopping cart"
          },
          {
            "path": "../../assets/projects/internship/image-02.jpg",
            "alt": "Digital illustration design process showing sketches and final artwork development"
          },
          {
            "path": "../../assets/projects/internship/image-03.png",
            "alt": "AI-generated marketing banner background for remarketing campaign"
          },
          {
            "path": "../../assets/projects/internship/image-04.png",
            "alt": "Performance marketing banner with AI-enhanced visuals and call-to-action"
          },
          {
            "path": "../../assets/projects/internship/image-05.png",
            "alt": "Product mockup created using AI photo manipulation and digital composition"
          },
          {
            "path": "../../assets/projects/internship/image-06.png",
            "alt": "Redesigned website navigation menu with improved user interface elements"
          },
          {
            "path": "../../assets/projects/internship/image-07.jpg",
            "alt": "Social media post design celebrating International Internet Day with custom graphics"
          }
        ],
        "tools": ["Midjourney", "Notion", "Figma", "Adobe Photoshop"],
        "github-link": null,
        "description": "At E-goi, I worked on the creation of digital content for performance marketing and social media, including ad banners, AI-generated visuals, illustrations, and photo manipulation. I also conducted 5-second tests, A/B testing, and performance analysis on Instagram, along with KPI reviews and competitive research. This experience gave me insight into the challenge brands face to remain relevant in a fast-paced digital world — a lesson that shaped me both professionally and personally."
      },
      {
        "title": "Olá",
        "year": 2025,
        "type": "Aside Project that I worked on during my internship at E-goi",
        "cover": {
          "path": "../../assets/projects/ola/cover.jpg",
          "alt": "Summer campaign illustration featuring ice creams on beach with Heartbrand logo"
        },
        "images": [
          {
            "path": "../../assets/projects/ola/cover-02.png",
            "alt": "Beach scene illustration with various ice cream products and Heartbrand logo centerpiece"
          },
          {
            "path": "../../assets/projects/ola/image-01.jpeg",
            "alt": "Website banner mockup for restaurant partners featuring summer ice cream campaign"
          },
          {
            "path": "../../assets/projects/ola/image-02.png",
            "alt": "Vertical banner design for Heartbrand summer campaign with 5 Summer Heroes products"
          },
          {
            "path": "../../assets/projects/ola/image-03.png",
            "alt": "Horizontal banner layout showcasing summer ice cream collection for desktop display"
          },
          {
            "path": "../../assets/projects/ola/image-04.png",
            "alt": "Mobile-optimized horizontal banner design for summer campaign promotion"
          }
        ],
        "tools": ["Figma"],
        "github-link": null,
        "description": "During my internship at E-goi, I had the opportunity to collaborate on a summer campaign for Olá (Heartbrand), promoting their top-selling ice creams — the so-called '5 Summer Heroes.' I created the entire illustration by hand, following the Heartbrand's visual identity guidelines, and designed all versions of the campaign banners in Figma. These assets were adapted for desktop and mobile, and used across multiple channels: websites, emails, and digital ads aimed at restaurants and business partners. This project was a great opportunity to apply brand consistency within a commercial campaign, balancing creativity with clear marketing goals."
      }
    ]
  }